Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: If you download and install the `exiftool` program, you can use it to convert your images into text about the metadata, so at least the diff will show you a textual representation of any changes that happened:
cs: Pokud stáhnete a nainstalujete program `exiftool`, můžete ho použít ke konverzi obrázků na text prostřednictvím metadat, a nástroj diff vám tak přinejmenším zobrazí textovou verzi všech provedených změn.

source: If you edit one of the files and commit it, you have a commit that exists in Git locally that doesn’t exist on the Subversion server:
cs: Upravíte-li některý ze souborů a provedené změny zapíšete, budete mít revizi, která existuje lokálně v systému Git, ale neexistuje na serveru Subversion:

source: If you edit that file manually, it remains like that until the next successful push to the `gitosis-admin` project.
cs: Pokud soubor ručně upravíte, zůstane v této podobě až do dalšího úspěšného odeslání do projektu `gitosis-admin`.

source: If you ever need help while using Git, there are three ways to get the manual page (manpage) help for any of the Git commands:
cs: Budete-li někdy při používání systému Git potřebovat pomoc, existují tři způsoby, jak vyvolat nápovědu z manuálové stránky (manpage) pro jakýkoli z příkazů systému Git:

source: If you examine the log of a rebased branch, it looks like a linear history: it appears that all the work happened in series, even when it originally happened in parallel.
cs: Pokud si prohlížíte log přeskládané větve, vypadá jako lineární historie – zdá se, jako by veškerá práce probíhala v jedné linii, ačkoli původně byla paralelní.

source: If you follow all the internal pointers, you get an object graph something like Figure 9-3.
cs: Pokud byste hledali vztahy mezi všemi interními ukazateli, vyšel by vám celý diagram objektů – viz obrázek 9-3.

source: If you follow that guideline, you’ll be fine.
cs: Budete-li se touto zásadou řídit, nemusíte se přeskládání obávat.

source: If you follow those guidelines, working with a Subversion server can be more bearable.
cs: Budete-li dodržovat tato pravidla, bude práce se serverem Subversion snesitelnější.

source: If you get on an airplane or a train and want to do a little work, you can commit happily until you get to a network connection to upload.
cs: Jste-li v letadle nebo ve vlaku a chcete pokračovat v práci, můžete beze všeho zapisovat nové revize. Ty odešlete až po opětovném připojení k síti.

source: If you go back to an earlier example from the Merge section (see Figure 3-27), you can see that you diverged your work and made commits on two different branches.
cs: Pokud se vrátíme k našemu dřívějšímu příkladu z části o slučování větví (viz obrázek 3-27), vidíme, že jsme svoji práci rozdělili a vytvářeli revize ve dvou různých větvích.

source: If you go home and can’t get your VPN client working properly, you can still work.
cs: Jestliže přijedete domů a zjistíte, že VPN klient nefunguje, stále můžete pracovat.

source: If you go into the new `grit` directory, you’ll see the project files in there, ready to be worked on or used.
cs: Přejdete-li do nového adresáře `grit`, uvidíte v něm soubory projektu připravené ke zpracování nebo jinému použití.

source: If you go to the `/opt/p4import` directory and run `git log`, you can see your imported work:
cs: Přejdete-li do adresáře `/opt/p4import` a spustíte příkaz `git log`, uvidíte, co jste importovali:

source: If you had run that instead, you’d have gotten back to your original position:
cs: Pokud jste spustili příkaz v této podobě, vrátili jste se zpět na svou původní pozici:

source: If you have Git version 1.6.2 or later, you can also use the `--track` shorthand:
cs: Máte-li Git ve verzi 1.6.2 nebo novější, můžete použít také zkrácenou variantu `--track`:

source: If you have Homebrew installed, install Git via
cs: Pokud máte Homebrew nainstalován, pak nainstalujete Git příkazem

source: If you have MacPorts installed, install Git via
cs: Máte-li systém MacPorts nainstalován, nainstalujte Git příkazem:

source: If you have a QA team that pushes a series of branches, and you want to get the master branch and any of the QA team’s branches but nothing else, you can use a config section like this:
cs: Jestliže pracujete v QA týmu, který odesílá několik větví, a vy chcete stáhnout hlavní větev a všechny větve QA týmu, avšak žádné jiné, můžete použít například takovouto část konfigurace:

source: If you have a branch named `serverfix` that you want to work on with others, you can push it up the same way you pushed your first branch.
cs: Máte-li větev s názvem `serverfix`, na níž chcete spolupracovat s ostatními, můžete ji odeslat stejným způsobem, jakým jste odesílali svou první větev.

source: If you have a branch set up to track a remote branch (see the next section and _Chapter 3_ for more information), you can use the `git pull` command to automatically fetch and then merge a remote branch into your current branch.
cs: Pokud máte větev nastavenou ke sledování vzdálené větve (více informací naleznete v následující části a v _kapitole 3_, můžete použít příkaz `git pull`, který automaticky vyzvedne (fetch) a poté začlení (merge) vzdálenou větev do vaší aktuální větve.

source: If you have a commit-message policy in place, then putting a template for that policy on your system and configuring Git to use it by default can help increase the chance of that policy being followed regularly.
cs: Máte-li stanoveny standardy pro vytváření zpráv k revizím, může vám vytvoření šablony podle těchto standardů a nastavení systému Git na její používání pomoci k dodržování těchto standardů.

source: If you have a complex workflow process that has a QA team pushing branches, developers pushing branches, and integration teams pushing and collaborating on remote branches, you can namespace them easily this way.
cs: Jestliže používáte komplexní pracovní proces, kdy QA tým odesílá větve, vývojáři odesílají větve a integrační týmy odesílají větve a spolupracují na nich, můžete takto jednoduše využít možností, jež vám jmenný prostor nabízí.

source: If you have a lot of tags that you want to push up at once, you can also use the `--tags` option to the `git push` command.
cs: Máte-li značek více a chcete je odeslat všechny najednou, můžete použít také parametr `--tags`, který se přidává k příkazu `git push`.

source: If you have a shared mounted filesystem, then you can clone, push to, and pull from a local file-based repository.
cs: Máte-li připojený sdílený systém souborů, můžete klonovat, odesílat a stahovat z lokálního souborového repozitáře (local file-based repository).

source: If you have a small team or are already comfortable with a centralized workflow in your company or team, you can easily continue using that workflow with Git.
cs: Pokud pracujete v malém týmu nebo už jste ve své společnosti nebo ve svém týmu zvyklí na centralizovaný pracovní postup, můžete v něm beze všeho pokračovat.

source: If you have a version of Git earlier than 1.7.11, then the importer is only available in the `contrib` section of the source code.
cs: Pokud máte verzi Git starší než 1.7.11, pak importér naleznete jen v sekci `contrib` zdrojového kódu.

source: If you have an existing codebase in another VCS but you’ve decided to start using Git, you must migrate your project one way or another.
cs: Máte-li existující základ kódu v jiném systému VCS, ale rádi byste začali používat Git, můžete do něj svůj projekt převést. Existuje přitom několik způsobů.

source: If you have an existing public Subversion project that you want to import into Git, GitHub can often do that for you.
cs: Máte-li existující veřejný projekt Subversion, který byste rádi importovali do systému Git, GitHub vám s tím obvykle pomůže.

source: If you have any issues, it may be useful to add `loglevel=DEBUG` under the `[gitosis]` section.
cs: Máte-li jakékoli problémy, může vám pomoci zadání `loglevel=DEBUG` do části `[gitosis]`.

source: If you have it available, this is a good time to add your public SSH key as well.
cs: Po vyplnění osobních údajů nadešel vhodný čas k vložení vašeho veřejného klíče SSH.

source: If you have it read the message from the file passed as the first argument and compare that to the pattern, you can force Git to abort the commit if there is no match:
cs: Necháte-li zásuvný modul přečíst zprávu k revizi ze souboru, který zadáte jako první parametr, a srovnat se vzorem, můžete systému Git uložit, aby odmítl revize, které vzoru neodpovídají:

source: If you have local changes, you must either stash your work or temporarily commit it before running `git svn rebase` — otherwise, the command will stop if it sees that the rebase will result in a merge conflict.
cs: Máte-li lokální změny, musíte ještě před spuštěním příkazu `git svn rebase` práci buď odložit (stash), nebo ji dočasně zapsat. V opačném případě nebude příkaz proveden, protože systém zjistí, že by přeskládání vedlo ke konfliktu.

source: If you have more developers or a larger project, you’ll probably want to use at least a two-phase merge cycle.
cs: Máte-li více vývojářů nebo větší projekt, pravděpodobně budete chtít použít přinejmenším dvoufázový cyklus začlenění.

source: If you have more than one remote, the command lists them all.
cs: Pokud používáte více než jeden vzdálený repozitář, příkaz je vypíše všechny.

source: If you have multiple submodules, you’ll have multiple entries in this file.
cs: Máte-li submodulů více, bude v tomto souboru několik záznamů.

source: If you have no interest in running your own server, you can skip to the last section of the chapter to see some options for setting up a hosted account and then move on to the next chapter, where we discuss the various ins and outs of working in a distributed source control environment.
cs: Pokud víte, že nebudete chtít spravovat vlastní server, můžete přeskočit rovnou na poslední část této kapitoly a podívat se na možnosti nastavení hostovaného účtu. Pak přejděte na následující kapitolu, v níž se dočtete o detailech a záludnostech při práci v prostředí s distribuovanou správou zdrojového kódu.

source: If you just need to get it out of the way, we’ll go over stashing and branching in the next chapter; these are generally better ways to go.
cs: Pokud potřebujete pouze odstranit soubor z cesty, podívejte se na odkládání (stashing) a větvení v následující kapitole. Tyto postupy většinou bývají vhodnější.

source: If you just specify the path, and the source and the destination are on the same filesystem, Git tries to hardlink the objects it needs.
cs: Pokud pouze zadáte cestu a zdroj i cíl se nacházejí ve stejném systému souborů, pokusí se Git použít hardlinky na potřebné objekty.

source: If you leave off the `[localbranch]` portion, then you’re basically saying, “Take nothing on my side and make it be `[remotebranch]`.”
cs: Pokud vynecháte složku `[lokální větev]`, pak v podstatě říkáte: „Neber na mé straně nic a toto nic teď bude `[vzdálená větev]`.“

source: If you like to use a more graphical tool to visualize your commit history, you may want to take a look at a Tcl/Tk program called `gitk` that is distributed with Git.
cs: Chcete-li použít graficky výrazněji zpracovaný nástroj k procházení historie revizí, možná oceníte Tcl/Tk program nazvaný `gitk`, který je distribuován spolu se systémem Git.

source: If you look at the `gitosis.conf` file, it should only specify information about the `gitosis-admin` project that you just cloned:
cs: Pokud se podíváte na soubor `gitosis.conf`, měl by udávat pouze informace o projektu `gitosis-admin`, který jste právě naklonovali:

source: If you look at the file, you’ll normally see something like this:
cs: Pokud se na soubor podíváte, můžete v něm najít třeba následující:

source: If you look at the last commit, you can see the new `git-svn-id` that was added:
cs: Pokud se podíváte na poslední revizi, uvidíte nově přidané `git-svn-id`:

source: If you look at the resulting tree, you can see the SHA-1 value your repo.rb file got for the blob object:
cs: Pokud se podíváte na výsledný strom, uvidíte hodnotu SHA-1, kterou soubor repo.rb dostal pro objekt blobu:

source: If you look in your objects directory, you’ll find that most of your objects are gone, and a new pair of files has appeared:
cs: Podíváte-li se do adresáře s objekty, zjistíte, že většina objektů zmizela. Zato se objevily dva nové:

source: If you make some changes and commit again, the next commit stores a pointer to the commit that came immediately before it.
cs: Jestliže v souborech provedete změny a zapíšete je, další revize uloží ukazatel na revizi, jež jí bezprostředně předcházela.

source: If you merge in the other branch, instead of having merge conflicts with the database.xml file, you see something like this:
cs: Pokud začleníte druhou větev, místo řešení konfliktů u souboru database.xml se zobrazí následující:

source: If you mistype a command in Git, it shows you something like this:
cs: Pokud ve verzi 1.6 uděláte překlep v příkazu, zobrazí se asi toto:

source: If you modified the file and added it to the index already, you must force the removal with the `-f` option.
cs: Pokud už jste soubor upravili a přidali do indexu, musíte odstranění provést pomocí parametru `-f`.

source: If you modify a file after you run `git add`, you have to run `git add` again to stage the latest version of the file:
cs: Pokud upravíte soubor po provedení příkazu `git add`, je třeba spustit `git add` ještě jednou, aby byla připravena aktuální verze souboru:

source: If you name your trunk, branches, or tags differently, you can change these options.
cs: Pokud pojmenujete svůj kmenový adresář (trunk), větve nebo značky jinak, lze tyto parametry změnit.

source: If you need to pull it in, you can merge your `master` branch into your `iss53` branch by running `git merge master`, or you can wait to integrate those changes until you decide to pull the `iss53` branch back into `master` later.
cs: Pokud potřebujete tyto změny do větve vtáhnout, můžete začlenit větev `master` do větve `iss53` provedením příkazu `git merge master`. Druhou možností je s integrací změn vyčkat a provést ji až ve chvíli, kdy budete chtít větev `iss53` vtáhnout zpět do větve `master`.

source: If you need to revoke access to individuals, you can click the "revoke" link, and their push access will be removed.
cs: Pokud potřebujete oprávnění pro některého z uživatelů zrušit, klikněte na odkaz „revoke“. Tím odstraníte jeho oprávnění k odesílání dat.

source: If you need, for some reason, to use the native Windows shell / command line console, you have to use double quotes instead of single quotes (for parameters with spaces in them) and you must quote the parameters ending with the circumflex accent (^) if they are last on the line, as it is a continuation symbol in Windows.
cs: Pokud z nějakého důvodu potřebujete používat původní windowsovský shell / konzoli příkazové řádky, budete muset používat místo apostrofů uvozovky (pro parametry s mezerami uvnitř), a parametry končící stříškou (^) budete muset uzavírat do uvozovek v případě, kdy se stříška nachází na konci řádku. Ve Windows se totiž používá jako pokračovací znak.

source: If you only want to modify your last commit message, it’s very simple:
cs: Chcete-li pouze změnit zprávu k poslední revizi, je to velmi jednoduché:

source: If you pass `--abbrev-commit` to the `git log` command, the output will use shorter values but keep them unique; it defaults to using seven characters but makes them longer if necessary to keep the SHA-1 unambiguous:
cs: Zadáte-li k příkazu `git log` parametr `--abbrev-commit`, výstup bude používat kratší hodnoty, ale pouze v jednoznačném tvaru. Standardně se používá sedm znaků, avšak je-li to kvůli jednoznačnosti hodnoty SHA-1 nezbytné, bude použito znaků více:

source: If you pass `--objects` to `rev-list`, it lists all the commit SHAs and also the blob SHAs with the file paths associated with them.
cs: Zadáte-li k příkazu `rev-list` parametr `--objects`, výpis bude obsahovat všechny hodnoty SHA revizí a blobů s cestami k souborům, které jsou s nimi asociovány.

source: If you pass `-C` to `git blame`, Git analyzes the file you’re annotating and tries to figure out where snippets of code within it originally came from if they were copied from elsewhere.
cs: Zadáte-li k příkazu `git blame` parametr `-C`, Git zanalyzuje soubor, který anotujete, a pokud jednotlivé kousky kódu v něm obsažené pocházejí původně odjinud, pokusí se Git zjistit odkud.

source: If you pass the option `--system` to `git config`, it reads and writes from this file specifically.
cs: Zadáte-li parametr `--system` do nástroje `git config`, bude Git načítat a zapisovat pouze do tohoto souboru.

source: If you pass the option` --system` to `git config`, it reads and writes from this file specifically.
cs: Pokud příkazu `git config` zadáme parametr `--system` bude číst a zapisovat jen do tohoto souboru.

source: If you place a `^` at the end of a reference, Git resolves it to mean the parent of that commit.
cs: Umístíte-li na konec reference znak `^`, Git bude referenci chápat tak, že označuje rodiče dané revize.

source: If you place your data on a hosted server, it’s easy to set up and maintain; however, you have to be able to keep your code on someone else’s servers, and some organizations don’t allow that.
cs: Umístíte-li data na hostovaný server, je jejich nastavení a správa jednoduchá. Svůj zdrojový kód však v takovém případě ukládáte na cizím serveru, což některé organizace nedovolují.

source: If you press Enter after typing nothing at the `Update>>` prompt, Git takes anything selected and stages it for you:
cs: Jestliže na výzvu `Update>>` nic nezadáte a stisknete klávesu Enter, Git vezme všechny vybrané soubory a připraví je k zapsání:

source: If you push commits somewhere and others pull them down and base work on them, and then you rewrite those commits with `git rebase` and push them up again, your collaborators will have to re-merge their work and things will get messy when you try to pull their work back into yours.
cs: Pokud odešlete svou práci, ostatní si ji stáhnou a založí na nich svou práci. A vy potom tyto revize přepíšete příkazem `git rebase` a znovu je odešlete, vaši spolupracovníci do ní budou muset znovu začlenit svou práci a ve všem nastane chaos, až se pokusíte natáhnout jejich práci zpět do své.

source: If you read the previous section about using `git svn`, you can easily use those instructions to `git svn clone` a repository; then, stop using the Subversion server, push to a new Git server, and start using that.
cs: Pokud jste si přečetli předchozí část o používání nástrojů `git svn`, můžete získané informace použít. Příkazem `git svn clone` naklonujte repozitář, odešlete ho na nový server Git a začněte používat ten.

source: If you really do want to delete the branch and lose that work, you can force it with `-D`, as the helpful message points out.
cs: Pokud chcete větev skutečně odstranit a zahodit práci, kterou obsahuje, můžete si to vynutit parametrem `-D` (jak napovídá užitečná zpráva pod řádkem s chybovým hlášením).

source: If you really wanted to, you could remove the object completely by running `git prune --expire`.
cs: Pokud jste chtěli, mohli jste objekt zcela odstranit příkazem `git prune --expire`.

source: If you rebase commits that have already been pushed publicly, and people may have based work on those commits, then you may be in for some frustrating trouble.
cs: Jestliže ale přeskládáte revize, které už byly zveřejněny a někdo na nich mohl založit svou práci, můžete si tím nepěkně zavařit.

source: If you rebase commits that you’ve already pushed and then try to push again, or otherwise try to push a commit to a remote branch that doesn’t contain the commit that the remote branch currently points to, you’ll be denied.
cs: Pokud přeskládáte revize, které jste již odeslali, a poté se je pokusíte odeslat ještě jednou nebo pokud se pokusíte odeslat revizi do vzdálené větve, která neobsahuje revizi, na niž právě vzdálená větev ukazuje, bude váš požadavek zamítnut.

source: If you receive a patch over e-mail that you need to integrate into your project, you need to apply the patch in your topic branch to evaluate it.
cs: Jestliže obdržíte e-mailem záplatu, kterou potřebujete integrovat do svého projektu, aplikujete ho nejprve do tematické větve, v níž ho vyhodnotíte.

source: If you received the patch from someone who generated it with the `git diff` or a Unix `diff` command, you can apply it with the `git apply` command.
cs: Pokud dostanete záplatu od někoho, kdo ji vygeneroval příkazem `git diff` nebo unixovým příkazem `diff`, můžete ho aplikovat příkazem `git apply`.

source: If you rename a file in Git, no metadata is stored in Git that tells it you renamed the file.
cs: Pokud soubor v systému Git přejmenujete, neuloží se žádná metadata s informací, že jste soubor přejmenovali.

source: If you replace an image in your project and run `git diff`, you see something like this:
cs: Pokud nahradíte některý z obrázků ve svém projektu a spustíte příkaz `git diff`, zobrazí se asi toto:

source: If you run `chmod u+x .git/hooks/update`, which is the file into which you should have put all this code, and then try to push a non-fast-forward reference, you’ll get something like this:
cs: Spustíte-li příkaz `chmod u+x .git/hooks/update`, což je soubor, do nějž byste měli celý tento kód vložit a poté zkusit odeslat referenci, která nesměřuje rychle vpřed, dostanete následující výstup:

source: If you run `git add` with the `-i` or `--interactive` option, Git goes into an interactive shell mode, displaying something like this:
cs: Spustíte-li příkaz `git add` s parametrem `-i` nebo `--interactive`, přejde Git do interaktivního režimu shellu a zobrazí zhruba následující:

source: If you run `git checkout test`, Git updates the file to look like this:
cs: Spustíte-li příkaz `git checkout test`, Git aktualizuje soubor do následující podoby:

source: If you run `git diff` normally, you only see something like this:
cs: Spustíte-li příkaz `git diff` normálně, zobrazí se zhruba toto:

source: If you run `git diff` on that, you see something interesting:
cs: Pokud na ni použijete příkaz `git diff`, uvidíte zajímavou věc:

source: If you run `git gc`, all the objects are in a packfile; you can identify the big objects by running another plumbing command called `git verify-pack` and sorting on the third field in the output, which is file size.
cs: Spustíte-li příkaz `git gc`, všechny objekty jsou v balíčkovém souboru. Velké objekty lze identifikovat spuštěním jiného nízkoúrovňového příkazu, `git verify-pack`, a seřazením podle třetího pole ve výpisu, v němž je uvedena velikost souboru.

source: If you run `git gc`, you’ll no longer have these files in the `refs` directory.
cs: Spustíte-li příkaz `git gc`, tyto soubory z adresáře `refs` zmizí.

source: If you run `git log`, you can see that all the SHA-1 checksums for the commits have changed, but the `git-p4` strings are no longer in the commit messages:
cs: Spustíte-li příkaz `git log`, uvidíte, že se změnily všechny kontrolní součty revizí SHA-1, zato všechny řetězce `git-p4` ze zpráv k revizím zmizely:

source: If you run `git push --tags`, the `maintainer-pgp-pub` tag will be shared with everyone.
cs: Zadáte-li příkaz `git push --tags`, začnete značku `maintainer-pgp-pub` sdílet s ostatními.

source: If you run `git show` on that tag, you can see your GPG signature attached to it:
cs: Pokud pro tuto značku spustíte příkaz `git show`, uvidíte k ní připojen svůj podpis GPG:

source: If you run `git status` right after you add the submodule, you see two things:
cs: Pokud byste bezprostředně po přidání submodulu spustili příkaz `git status`, viděli byste dvě věci:
